In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\tku-staff\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\tku-staff\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\tku-staff\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\tku-staff\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\users\tku-staff\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
pd

In [4]:
hipandas=pd.Series([1,2,3,4,5])
print(hipandas)
print(hipandas.values)
print(hipandas.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [5]:
dict1={'Taipei':"台北",'Taichung':"台中",'Kaohsiung':"高雄"}
city=pd.Series(dict1)
print(city)
print(city.index)
print(city['Taipei'])

Taipei       台北
Taichung     台中
Kaohsiung    高雄
dtype: object
Index(['Taipei', 'Taichung', 'Kaohsiung'], dtype='object')
台北

In [6]:
print(city["Taichung":"Kaohsiung"])

Taichung     台中
Kaohsiung    高雄
dtype: object

In [7]:
hipandas[0]

1

In [8]:
hipandas[1]

2

In [9]:
hipandas[2]

3

In [10]:
se1=pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [11]:
se1['a']

1

In [12]:
se1['b']

2

In [13]:
se1['c']

3

In [14]:
df=pd.DataFrame([[65,92,78,83,70],
                 [90,72,76,93,56],
                 [81,85,91,89,77],
                 [79,53,47,94,80]])

In [15]:
df

    0   1   2   3   4
0  65  92  78  83  70
1  90  72  76  93  56
2  81  85  91  89  77
3  79  53  47  94  80

In [19]:
df1=pd.DataFrame([[65,92,78,83,70],
                  [90,72,76,93,56],
                  [81,85,91,89,77],
                  [79,53,47,94,80]],
                index=['王小明','李小美','陳大同','林小玉'],
                columns=['國文','英文','數學','自然','社會'])

In [20]:
df1

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  77
林小玉  79  53  47  94  80

In [21]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df2 = pd.DataFrame(scores)
df2

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [22]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df3 = pd.DataFrame({ '國文':se1,'英文':se2,'數學':se3,
                   '自然':se4,'社會':se5} )
df3

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [23]:
se1 = pd.Series({'王小明':65,'李小美':90,'陳大同':81,'林小玉':79})
se2 = pd.Series({'王小明':92,'李小美':72,'陳大同':85,'林小玉':53})
se3 = pd.Series({'王小明':78,'李小美':76,'陳大同':91,'林小玉':47})
se4 = pd.Series({'王小明':83,'李小美':93,'陳大同':89,'林小玉':94})
se5 = pd.Series({'王小明':70,'李小美':56,'陳大同':94,'林小玉':80})
df4 = pd.concat([se1,se2,se3,se4,se5], axis=1)
df4.columns=['國文','英文','數學','自然','社會']
df4

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [24]:
df4["自然"]

王小明    83
李小美    93
陳大同    89
林小玉    94
Name: 自然, dtype: int64

In [25]:
df4["數學"]

王小明    78
李小美    76
陳大同    91
林小玉    47
Name: 數學, dtype: int64

In [26]:
df4["社會"]

王小明    70
李小美    56
陳大同    94
林小玉    80
Name: 社會, dtype: int64

In [28]:
df4[["自然","數學","社會"]]

     自然  數學  社會
王小明  83  78  70
李小美  93  76  56
陳大同  89  91  94
林小玉  94  47  80

In [29]:
df4[df4["國文"] >= 80]

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94

In [30]:
df4[df4["數學"] >= 80]

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94

In [31]:
df4[df4["英文"] >= 90]

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70

In [32]:
df4.values

array([[65, 92, 78, 83, 70],
       [90, 72, 76, 93, 56],
       [81, 85, 91, 89, 94],
       [79, 53, 47, 94, 80]], dtype=int64)

In [33]:
df4.values[1]

array([90, 72, 76, 93, 56], dtype=int64)

In [34]:
df4.values[1][2]

76

In [35]:
df4.values[3][4]

80

In [36]:
df4.loc["林小玉", "社會"]

80

In [37]:
df4.loc["王小明", ["國文","社會"]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [38]:
df4.loc[["王小明", "李小美"], ["數學", "自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [39]:
df4.loc["王小明":"陳大同", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [40]:
df4.loc["王小明":"陳大同", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [41]:
df4.loc["陳大同", :]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [42]:
df4.loc[:"李小美", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56

In [43]:
df4.loc["林小玉", "社會"]

80

In [44]:
df4.loc["王小明", ["國文","社會"]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [45]:
df4.loc[["王小明", "李小美"], ["數學", "自然"]]

     數學  自然
王小明  78  83
李小美  76  93

In [46]:
df4.loc["王小明":"陳大同", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [47]:
df4.loc["陳大同", :]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [48]:
df4.loc[:"李小美", "數學":"社會"]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56

In [49]:
df4.loc["李小美":, "數學":"社會"]

     數學  自然  社會
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80

In [50]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df5 = pd.DataFrame(scores)
df5

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [51]:
df5.iloc[3, 4]

80

In [52]:
df5.iloc[0, [0, 4]]

國文    65
社會    70
Name: 王小明, dtype: int64

In [53]:
df5.iloc[[0, 1], [2, 3]]

     數學  自然
王小明  78  83
李小美  76  93

In [54]:
df5.iloc[0:3, 2:5]

     數學  自然  社會
王小明  78  83  70
李小美  76  93  56
陳大同  91  89  94

In [55]:
df5.iloc[2, :]

國文    81
英文    85
數學    91
自然    89
社會    94
Name: 陳大同, dtype: int64

In [56]:
df5.iloc[1:, 2:5]

     數學  自然  社會
李小美  76  93  56
陳大同  91  89  94
林小玉  47  94  80

In [57]:
df5.head(2)

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56

In [58]:
df5.tail(2)

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [59]:
df5.sort_values(by="數學", ascending=False)

     國文  英文  數學  自然  社會
陳大同  81  85  91  89  94
王小明  65  92  78  83  70
李小美  90  72  76  93  56
林小玉  79  53  47  94  80

In [60]:
df5.sort_values(by="國文", ascending=False)

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80
王小明  65  92  78  83  70

In [61]:
df5.sort_index(axis=0)

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
林小玉  79  53  47  94  80
王小明  65  92  78  83  70
陳大同  81  85  91  89  94

In [62]:
df5.sort_index(axis=1)

     國文  數學  社會  自然  英文
王小明  65  78  70  83  92
李小美  90  76  56  93  72
陳大同  81  91  94  89  85
林小玉  79  47  80  94  53

In [63]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df6 = pd.DataFrame(scores)
df6

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [64]:
df6.loc["王小明"]["數學"] = 90
df6

     國文  英文  數學  自然  社會
王小明  65  92  90  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [65]:
df6.loc["王小明"]["數學"] = 90
df6

     國文  英文  數學  自然  社會
王小明  65  92  90  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [66]:
scores = {'國文':{'王小明':65,'李小美':90,'陳大同':81,'林小玉':79},
          '英文':{'王小明':92,'李小美':72,'陳大同':85,'林小玉':53},
          '數學':{'王小明':78,'李小美':76,'陳大同':91,'林小玉':47},
          '自然':{'王小明':83,'李小美':93,'陳大同':89,'林小玉':94},
          '社會':{'王小明':70,'李小美':56,'陳大同':94,'林小玉':80}}
df7 = pd.DataFrame(scores)
df7

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [67]:
df7.drop("王小明")

     國文  英文  數學  自然  社會
李小美  90  72  76  93  56
陳大同  81  85  91  89  94
林小玉  79  53  47  94  80

In [68]:
df7.drop("數學", axis=1)

     國文  英文  自然  社會
王小明  65  92  83  70
李小美  90  72  93  56
陳大同  81  85  89  94
林小玉  79  53  94  80

In [69]:
df7.drop(["數學", "自然"], axis=1)

     國文  英文  社會
王小明  65  92  70
李小美  90  72  56
陳大同  81  85  94
林小玉  79  53  80

In [70]:
df7.drop(df7.index[1:3])

     國文  英文  數學  自然  社會
王小明  65  92  78  83  70
林小玉  79  53  47  94  80

In [71]:
df7.drop(df7.columns[1:4], axis=1)

     國文  社會
王小明  65  70
李小美  90  56
陳大同  81  94
林小玉  79  80

# exercise

In [74]:
import pandas as pd

df8 = pd.read_csv('covid19.csv')
df8

        country_ch                country_en        cases     deaths
0               美國             United States  102,717,337  1,143,992
1               印度                     India   44,689,072    530,776
2               法國                    France   39,661,650    165,135
3               德國                   Germany   38,241,231    168,808
4               巴西                    Brazil   37,085,520    699,310
..             ...                       ...          ...        ...
197            吐瓦魯                    Tuvalu        2,779          0
198             紐埃                      Niue          747          0
199  國際運輸工具(鑽石公主號)  Int'l conveyance (Japan)          741         13
200             教廷                  Holy See           29          0
201             北韓               North Korea            2          1

[202 rows x 4 columns]

In [86]:
type(df8)

pandas.core.frame.DataFrame

In [87]:
df8.head(2)

  country_ch     country_en        cases     deaths
0         美國  United States  102,717,337  1,143,992
1         印度          India   44,689,072    530,776

In [118]:
df9=df8.sort_values(by="country_en", ascending=True)

In [119]:
df9

    country_ch   country_en       cases  deaths
112        阿富汗  Afghanistan     209,451   7,896
99       阿爾巴尼亞      Albania     334,457   3,598
106      阿爾及利亞      Algeria     271,496   6,881
146        安道爾      Andorra      47,890     165
127        安哥拉       Angola     105,288   1,933
..         ...          ...         ...     ...
86        委內瑞拉    Venezuela     552,162   5,854
12          越南      Vietnam  11,527,012  43,186
179         葉門        Yemen      11,945   2,159
97         尚比亞       Zambia     343,135   4,057
108        辛巴威     Zimbabwe     264,276   5,671

[202 rows x 4 columns]

In [120]:
df8

        country_ch                country_en        cases     deaths
0               美國             United States  102,717,337  1,143,992
1               印度                     India   44,689,072    530,776
2               法國                    France   39,661,650    165,135
3               德國                   Germany   38,241,231    168,808
4               巴西                    Brazil   37,085,520    699,310
..             ...                       ...          ...        ...
197            吐瓦魯                    Tuvalu        2,779          0
198             紐埃                      Niue          747          0
199  國際運輸工具(鑽石公主號)  Int'l conveyance (Japan)          741         13
200             教廷                  Holy See           29          0
201             北韓               North Korea            2          1

[202 rows x 4 columns]

In [122]:
result=df8[df8['country_en']=='Taiwan']

In [123]:
result

   country_ch country_en       cases  deaths
14         臺灣     Taiwan  10,143,788  18,371